Autodesk.Revit.DB.TessellatedShapeBuilderFallback
Describes what  TessellatedShapeBuilder function
should do, if it cannot build a requested Autodesk.Revit.DB.TessellatedShapeBuilderTarget.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Mesh
If a requested geometrical object cannot be built using all data from the
face set(s), create a mesh while using as much data from the face
set(s) as possible.

Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Salvage
Ignore invalid data, and use all valid data. Note that if a complete set
of data describes a solid and some data are ignored, then the result
will be a sheet and not a solid.

Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Abort
Do nothing.